brew "bat"
brew "btop"
brew "buf"
brew "clang-format"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "cue-lang/tap/cue"
brew "curl"
brew "derailed/k9s/k9s"
brew "diff-so-fancy"
brew "diffutils"
brew "direnv"
brew "docker-compose"
brew "docker"
brew "eza"
brew "felixkratz/formulae/borders"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnupg"
brew "gnupg@1.4"
brew "go"
brew "go@1.19"
brew "go@1.21"
brew "golangci-lint"
brew "grpc"
brew "gum"
brew "htop"
brew "icu4c@76"
brew "jd"
brew "jq"
brew "kind"
brew "ktr0731/evans/evans"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "leptonica"
brew "libarchive"
brew "lolcat"
brew "make"
brew "node"
brew "openldap"
brew "pandoc"
brew "pgcli"
brew "php"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "podman"
brew "postgresql@14", restart_service: :changed
brew "protobuf"
brew "pyenv"
brew "python-tk@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "ripgrep"
brew "screenfetch"
brew "stern"
brew "terminal-notifier"
brew "tesseract"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "unbound"
brew "wget"
brew "yq"
brew "zoxide"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "android-file-transfer"
cask "dockdoor"
cask "discord"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "iterm2"
cask "notion"
cask "pgadmin4"
cask "postman"
cask "raycast"
cask "sequel-ace"
cask "spotify"
cask "the-unarchiver"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "yt-music"
tap "cue-lang/tap"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "ktr0731/evans"
vscode "aaron-bond.better-comments"
vscode "acarreiro.calculate"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "bierner.markdown-emoji"
vscode "bmewburn.vscode-intelephense-client"
vscode "breezelin.phpstan"
vscode "ckolkman.vscode-postgres"
vscode "cssho.vscode-svgviewer"
vscode "cweijan.vscode-office"
vscode "devonray.snippet"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "imagio.vscode-dimmer-block"
vscode "jerryhong.autofilename"
vscode "junstyle.php-cs-fixer"
vscode "kasik96.swift"
vscode "lunaryorn.fish-ide"
vscode "magicstack.magicpython"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mfuentesg.vscode-protolint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.theme-materialkit"
vscode "naumovs.color-highlight"
vscode "nickgo.cuelang"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-protolint"
vscode "pomdtr.excalidraw-editor"
vscode "randomfractalsinc.vscode-data-preview"
vscode "realvisualstudio.realcorecli"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "sky126.go-local-playground"
vscode "skyapps.fish-vscode"
vscode "sukumo28.wav-preview"
vscode "sysoev.vscode-open-in-github"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "wiredforge.secret-reader"
vscode "xaver.clang-format"
vscode "zxh404.vscode-proto3"
