brew "autoconf"
brew "automake"
brew "bat"
brew "btop"
brew "buf"
brew "ccusage"
brew "clang-format"
brew "cmake"
brew "cmatrix"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "cue-lang/tap/cue"
brew "curl"
brew "derailed/k9s/k9s"
brew "diff-so-fancy"
brew "diffutils"
brew "direnv"
brew "docker-compose"
brew "docker"
brew "eza"
brew "ezstream"
brew "felixkratz/formulae/borders"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "gifsicle"
brew "git-lfs"
brew "git"
brew "glib"
brew "gnupg"
brew "gnupg@1.4"
brew "go"
brew "go@1.21"
brew "gobject-introspection"
brew "golangci-lint"
brew "grip"
brew "grpc"
brew "grpcurl"
brew "gum"
brew "harfbuzz"
brew "htop"
brew "icu4c@76"
brew "imagemagick"
brew "jd"
brew "jq"
brew "kind"
brew "ktr0731/evans/evans"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "leptonica"
brew "libarchive"
brew "libksba"
brew "libtool"
brew "libyaml"
brew "lolcat"
brew "make"
brew "mongodb/brew/mongodb-community"
brew "mongosh"
brew "neofetch"
brew "nghttp2"
brew "node"
brew "node@14"
brew "nvm"
brew "openldap"
brew "pandoc"
brew "peonping/tap/peon-ping"
brew "pgcli"
brew "php"
brew "pinentry-mac"
brew "pipes-sh"
brew "pipx"
brew "pkgconf"
brew "podman"
brew "postgresql@14", restart_service: :changed
brew "protobuf"
brew "pyenv"
brew "python-tk@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "ripgrep"
brew "screenfetch"
brew "smimesign"
brew "sponge"
brew "stern"
brew "terminal-notifier"
brew "tesseract"
brew "testdisk"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tree"
brew "unbound"
brew "uv"
brew "wget"
brew "yq"
brew "zlib"
brew "zoxide"
cask "1password-cli"
cask "alfred"
cask "alt-tab"
cask "android-file-transfer"
cask "aqua"
cask "aquaproj/aqua/aqua"
cask "audacity"
cask "claude-code"
cask "cmux"
cask "discord"
cask "dockdoor"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "pgadmin4"
cask "raycast"
cask "sequel-ace"
cask "slack"
cask "the-unarchiver"
cask "tunnelblick"
cask "ubersicht"
cask "visual-studio-code"
cask "vlc"
cask "warp"
go "github.com/brads3290/cclogviewer/cmd/cclogviewer"
go "github.com/cweill/gotests/gotests"
go "github.com/divan/expvarmon"
go "github.com/fatih/gomodifytags"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golang/mock/mockgen"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/haya14busa/goplay/cmd/goplay"
go "github.com/josharian/impl"
go "github.com/kinbiko/kokodoko/cmd/kokodoko"
go "github.com/rakyll/hey"
go "github.com/ramya-rao-a/go-outline"
go "github.com/sanposhiho/gomockhandler"
go "github.com/sapuri/ghdump"
go "github.com/ServiceWeaver/weaver/cmd/weaver"
go "go.mercari.io/yo"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "honnef.co/go/tools/cmd/staticcheck"
tap "aquaproj/aqua"
tap "cue-lang/tap"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "homebrew/services"
tap "khanhas/tap"
tap "ktr0731/evans"
tap "manaflow-ai/cmux"
tap "mongodb/brew"
tap "peonping/tap"
vscode "aaron-bond.better-comments"
vscode "acarreiro.calculate"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "atlassian.atlascode"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "breezelin.phpstan"
vscode "charliermarsh.ruff"
vscode "ckolkman.vscode-postgres"
vscode "cssho.vscode-svgviewer"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "devonray.snippet"
vscode "docker.docker"
vscode "drblury.protobuf-vsc"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "imagio.vscode-dimmer-block"
vscode "jerryhong.autofilename"
vscode "junstyle.php-cs-fixer"
vscode "kasik96.swift"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "lunaryorn.fish-ide"
vscode "magicstack.magicpython"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mfuentesg.vscode-protolint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.theme-materialkit"
vscode "naumovs.color-highlight"
vscode "nickgo.cuelang"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "plex.vscode-protolint"
vscode "pomdtr.excalidraw-editor"
vscode "qwtel.sqlite-viewer"
vscode "randomfractalsinc.vscode-data-preview"
vscode "realvisualstudio.realcorecli"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "sky126.go-local-playground"
vscode "skyapps.fish-vscode"
vscode "sukumo28.wav-preview"
vscode "swiftlang.swift-vscode"
vscode "sysoev.vscode-open-in-github"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wiredforge.secret-reader"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
vscode "zoxon.monokai-light"
vscode "zxh404.vscode-proto3"
